"use strict";
/*
Оголоси функцію filterArray, яка очікує два параметри:

numbers — масив чисел
value — порогове значення
Функція повертає новий масив, що містить лише ті числа з numbers, які більші за value.



Усередині функції:

Створи порожній масив, у який будеш додавати підходящі числа.
Використай цикл для ітерації кожного елемента масиву numbers.
Використай умовний оператор if усередині циклу для перевірки кожного елемента і додавання до свого масиву.
Поверни свій новий масив з підходящими числами як результат.


Візьми код нижче і встав після оголошення своєї функції для перевірки коректності її роботи. У консоль будуть виведені результати її роботи.

console.log(filterArray([1, 2, 3, 4, 5], 3)); // [4, 5]
console.log(filterArray([1, 2, 3, 4, 5], 4)); // [5]
console.log(filterArray([1, 2, 3, 4, 5], 5)); // []
console.log(filterArray([12, 24, 8, 41, 76], 38)); // [41, 76]
console.log(filterArray([12, 24, 8, 41, 76], 20)); // [24, 41, 76]



Залиш цей код для перевірки ментором.



Вимоги

Оголошено функцію filterArray(numbers, value).
Виклик filterArray([1, 2, 3, 4, 5], 3) повертає [4, 5].
Виклик filterArray([1, 2, 3, 4, 5], 4) повертає [5].
Виклик filterArray([1, 2, 3, 4, 5], 5) повертає [].
Виклик filterArray([12, 24, 8, 41, 76], 38) повертає [41, 76].
Виклик filterArray([12, 24, 8, 41, 76], 20) повертає [24, 41, 76].
Виклик з будь-якими валідними аргументами повертає правильний масив.
Результати всіх викликів виведено в консоль.
*/

function filterArray(numbers, value) {
  let numberBiggerValue = [];
  for (let i = 0; i < numbers.length; i += 1) {
    if (numbers[i] > value) {
      numberBiggerValue.push(numbers[i]);
    }
  }
  return numberBiggerValue;
}

console.log(filterArray([1, 2, 3, 4, 5], 3)); // [4, 5]
console.log(filterArray([1, 2, 3, 4, 5], 4)); // [5]
console.log(filterArray([1, 2, 3, 4, 5], 5)); // []
console.log(filterArray([12, 24, 8, 41, 76], 38)); // [41, 76]
console.log(filterArray([12, 24, 8, 41, 76], 20)); // [24, 41, 76]
